# üö© DataFrameÏóê ÎåÄÌï¥ÏÑú
## Ï£ºÏöî ÌÜ†ÌîΩ
1. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Í∏∞Ï¥à
2. Îç∞Ïù¥ÌÑ∞ Ï†ëÍ∑º Î∞è Ï†úÍ±∞
3. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Í≤∞Ï∏°Í∞í
4. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ï†ïÎ†¨Í≥º ÌïÑÌÑ∞ÎßÅ
5. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ïª¨Îüº ÏàòÏ†ï
6. ÌåêÎã§Ïä§ Îç∞Ïù¥ÌÑ∞ ÌÉÄÏûÖ
7. Î©îÎ™®Î¶¨ ÏµúÏ†ÅÌôî
## Î™©Ìëú
- Ìñâ ÌïÑÌÑ∞ÎßÅ/Ï†ïÎ†¨, Í≤∞Ï∏°Í∞í Ï≤òÎ¶¨, ÏÉàÎ°úÏö¥ Ïª¨Îüº Ï∂îÍ∞Ä, Ïª¨ÎüºÏóê Ìï®Ïàò Ï†ÅÏö©ÌïòÍ∏∞

In [1]:
import numpy as np
import pandas as pd

## 1. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏù¥ÎûÄ?
- Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò Ïó¥ÏùÄ ÌïòÎÇòÏùò SeriesÏù¥Îã§
    - Í∞Å Ïª¨ÎüºÏùÄ ÎèôÏùºÌïú Ìñâ Ïù∏Îç±Ïä§Î•º Í≥µÏú†ÌïúÎã§.
    - Í∞Å Ïª¨ÎüºÎ™Ö = column index. Series name ÏÜçÏÑ±Í∞íÏùÑ Ìè¨Ìï®ÌïúÎã§.
### > Ï£ºÏöî ÏÜçÏÑ±
1. shape
2. index (Ìñâ Ïù∏Îç±Ïä§)
3. columns
4. axes (ÌñâÍ≥º Ïó¥Ïùò Ïù∏Îç±Ïä§)
5. dtypes (Í∞Å SeriesÏùò Îç∞Ïù¥ÌÑ∞ ÌÉÄÏûÖ)

In [2]:
oil = pd.read_csv('./data/retail/oil.csv')
oil

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [3]:
oil.shape

(1218, 2)

In [4]:
oil.axes

[RangeIndex(start=0, stop=1218, step=1),
 Index(['date', 'dcoilwtico'], dtype='object')]

In [5]:
oil.index

RangeIndex(start=0, stop=1218, step=1)

In [6]:
oil.columns

Index(['date', 'dcoilwtico'], dtype='object')

In [7]:
oil.columns = ['price_date', 'oil_price']
oil.head()

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

### > Ï£ºÏöî Î©îÏÑúÎìú
1. head, tail
2. sample (ÏûÑÏùòÏùò Ìñâ Îç∞Ïù¥ÌÑ∞ Ï∂îÏ∂ú)
3. info (Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Í∏∞Î≥∏ Ï†ïÎ≥¥)
4. describe (Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò ÌÜµÍ≥Ñ Ï†ïÎ≥¥; ONLY numeric columns BY DEFAULT)

In [8]:
oil.head()

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

In [9]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1218 non-null   object
 1   oil_price   1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [10]:
oil.describe()

         oil_price
count  1175.000000
mean     67.714366
std      25.630476
min      26.190000
25%      46.405000
50%      53.190000
75%      95.660000
max     110.620000

In [11]:
oil.describe(include='all')

        price_date    oil_price
count         1218  1175.000000
unique        1218          NaN
top     2013-01-01          NaN
freq             1          NaN
mean           NaN    67.714366
std            NaN    25.630476
min            NaN    26.190000
25%            NaN    46.405000
50%            NaN    53.190000
75%            NaN    95.660000
max            NaN   110.620000

## 2. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ï°∞Ìöå
### > Îã®Ïùº Ïª¨Îüº Ï°∞Ìöå
- ÎåÄÍ¥ÑÌò∏Î•º ÏÇ¨Ïö©ÌïúÎã§
### > Î≥µÏàò Ïª¨Îüº Ï°∞Ìöå
- ÎåÄÍ¥ÑÌò∏Î•º ÏÇ¨Ïö©ÌïúÎã§
### > ‚úÖ Pro Tips
1. 1Í∞ú Ïù¥ÏÉÅÏùò Ïª¨ÎüºÏùÑ Ï°∞ÌöåÌïòÎäî Í≤ΩÏö∞ÏóêÎäî loc Ï†ëÍ∑ºÏûêÎ•º ÏÇ¨Ïö©ÌïòÎäî Ìé∏Ïù¥ Í∂åÏû•ÎêúÎã§.
    - ÎåÄÍ¥ÑÌò∏Îäî ÏÉàÎ°úÏö¥ Ïª¨ÎüºÏùÑ ÏÉùÏÑ±ÌïòÍ±∞ÎÇò Îπ†Î•∏ ÌôïÏù∏Ïù¥ ÌïÑÏöîÌï† ÎïåÎßå ÏÇ¨Ïö©ÌïúÎã§.

In [12]:
oil.columns = ['date', 'price']
oil.head()

         date  price
0  2013-01-01    NaN
1  2013-01-02  93.14
2  2013-01-03  92.97
3  2013-01-04  93.12
4  2013-01-07  93.20

In [13]:
oil['price'].head()

0      NaN
1    93.14
2    92.97
3    93.12
4    93.20
Name: price, dtype: float64

In [14]:
type(oil['price'])

pandas.core.series.Series

In [15]:
type(oil[['price']])

pandas.core.frame.DataFrame

In [16]:
oil[['price', 'date']]

      price        date
0       NaN  2013-01-01
1     93.14  2013-01-02
2     92.97  2013-01-03
3     93.12  2013-01-04
4     93.20  2013-01-07
...     ...         ...
1213  47.65  2017-08-25
1214  46.40  2017-08-28
1215  46.46  2017-08-29
1216  45.96  2017-08-30
1217  47.26  2017-08-31

[1218 rows x 2 columns]

### > iloc Ï†ëÍ∑ºÏûê
- Position-based
- [Ìñâ, Ïó¥]
### > loc Ï†ëÍ∑ºÏûê
- Label-based
- [Ìñâ, Ïó¥]

In [17]:
oil['euro_price'] = oil['price'] * 1.1
oil.head()

         date  price  euro_price
0  2013-01-01    NaN         NaN
1  2013-01-02  93.14     102.454
2  2013-01-03  92.97     102.267
3  2013-01-04  93.12     102.432
4  2013-01-07  93.20     102.520

In [18]:
oil.iloc[:3, :]

         date  price  euro_price
0  2013-01-01    NaN         NaN
1  2013-01-02  93.14     102.454
2  2013-01-03  92.97     102.267

In [19]:
oil.iloc[:3, -1]

0        NaN
1    102.454
2    102.267
Name: euro_price, dtype: float64

In [20]:
oil.iloc[:3, -2:]

   price  euro_price
0    NaN         NaN
1  93.14     102.454
2  92.97     102.267

In [21]:
oil.loc[:5, :]

         date  price  euro_price
0  2013-01-01    NaN         NaN
1  2013-01-02  93.14     102.454
2  2013-01-03  92.97     102.267
3  2013-01-04  93.12     102.432
4  2013-01-07  93.20     102.520
5  2013-01-08  93.21     102.531

In [22]:
oil.loc[:3, 'date']

0    2013-01-01
1    2013-01-02
2    2013-01-03
3    2013-01-04
Name: date, dtype: object

In [23]:
oil.loc[:3, ['date', 'euro_price']]

         date  euro_price
0  2013-01-01         NaN
1  2013-01-02     102.454
2  2013-01-03     102.267
3  2013-01-04     102.432

In [24]:
oil.loc[:3, ['euro_price', 'date']]

   euro_price        date
0         NaN  2013-01-01
1     102.454  2013-01-02
2     102.267  2013-01-03
3     102.432  2013-01-04

In [25]:
oil.loc[:3, 'date':'price']

         date  price
0  2013-01-01    NaN
1  2013-01-02  93.14
2  2013-01-03  92.97
3  2013-01-04  93.12